app/controllers/alerts_controller.rb

SELECT  "alerts".* FROM "alerts"   ORDER BY "alerts"."id" ASC LIMIT 1
---
	def index
		@alert = Alert.first