app/controllers/car_histories_controller.rb

SELECT  "spare_parts".* FROM "spare_parts"  WHERE "spare_parts"."name" = 'Logo LED ទ្វារ' LIMIT 1
---
	def create
		if params[:spare_part]
			spare_part_params = params[:spare_part][:name].split(",")
			@amount = spare_part_params[1]
			name = spare_part_params[0]
			@spare_part = SparePart.find_by_name(name)

SELECT "sell_reports".* FROM "sell_reports"  WHERE "sell_reports"."car_history_id" = 1
---
	def show
		@sell = SellReport.where(:car_history_id => params[:id])

SELECT  "car_histories".* FROM "car_histories"  WHERE "car_histories"."car_id" = 1 AND "car_histories"."entry_date" = '2015/11/06' LIMIT 1
INSERT INTO "sell_reports" ("car_history_id", "car_id", "created_at", "recieved", "return", "selling_price", "spare_part_id", "status", "sub_total", "total_price", "unit", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
SELECT  "spare_parts".* FROM "spare_parts"  WHERE "spare_parts"."code" = '00001' LIMIT 1
UPDATE "spare_parts" SET "amount_in_stock" = $1, "updated_at" = $2 WHERE "spare_parts"."id" = 1  [["amount_in_stock", 28], ["updated_at", "2015-11-06 07:05:19.428666"]]
---
	def print
		# redirect_to show_print_car_history_path
		if params[:_json].count > 0
			params[:_json].each do |el|
				car_id = el[:car_id]
				entry_date = el[:entry_date]
				car_history = CarHistory.find_by_car_id_and_entry_date(car_id, entry_date)
				if car_history
					SellReport.create!(:car_id => params[:id],
														 :spare_part_id => SparePart.find_by_code(el[:code].delete(" ")).id,
														 :unit => el[:amount],
														 :selling_price => el[:unit_price],
														 :total_price => el[:total_price],
														 :recieved => el[:recieved],
														 :sub_total => el[:sub_total],
														 :return => el[:return_money],
														 :status => "Paid",
														 :car_history_id => car_history.id
														)
					spare_part = SparePart.find_by_code(el[:code].delete(" "))
					spare_part.amount_in_stock = spare_part.amount_in_stock.to_f - el[:amount].to_f
					spare_part.save!