app/controllers/car_histories_controller.rb

	def index
		@car = CarHistory.new
		@spare_part = SparePart.new
		@car_info = Car.find_by_id(params[:car_id])
---
SELECT  "cars".* FROM "cars"  WHERE "cars"."id" = 14 LIMIT 1

	def print
		# redirect_to show_print_car_history_path
		if params[:_json].count > 0
			params[:_json].each do |el|
				car_id = el[:car_id]
				entry_date = el[:entry_date]
				car_history = CarHistory.last.id + 1
---
SELECT  "car_histories".* FROM "car_histories"   ORDER BY "car_histories"."id" DESC LIMIT 1