app/controllers/cars_controller.rb

	def index
		@cars = Car.paginate(:page => params[:page], :per_page => 10)
---
SELECT  "cars".* FROM "cars"  LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "cars"

	def new
		@invoice_number = Car.first.nil? ? "INV-00001" : Car.last.invoice_number.next
---
SELECT  "cars".* FROM "cars"   ORDER BY "cars"."id" DESC LIMIT 1

	def create
		@car = Car.new(car_params)
	  if @car.save
---
INSERT INTO "cars" ("created_at", "name", "plate_number", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-11-06 07:04:30.158424"], ["name", "Toyota"], ["plate_number", "2U-3456"], ["updated_at", "2015-11-06 07:04:30.158424"]]

	def show
		puts params
		two_id = params[:id].split("-")
		car_id = two_id[0]
		car_history_id = two_id[1]
		@sell = SellReport.where(:car_id => car_id, :car_history_id => car_history_id)
		@car = Car.find(car_id)
---
SELECT "sell_reports".* FROM "sell_reports"  WHERE "sell_reports"."car_id" = 11
SELECT  "cars".* FROM "cars"  WHERE "cars"."id" = ? LIMIT 1  [["id", 16]]

	def update
		@car = Car.find(params[:id])
---
SELECT  "cars".* FROM "cars"  WHERE "cars"."id" = ? LIMIT 1  [["id", 2]]

	def print
		# redirect_to show_print_car_history_path
		if params[:_json].count > 0
			car_history = CarHistory.create(:car_id => params[:car_id], :entry_date => params[:_json][0][:entry_date])
			last_history_id = car_history.id
			params[:_json].each do |el|
				car_id = el[:car_id]
				entry_date = el[:entry_date]
				if last_history_id
					@sell_report = SellReport.create!(:car_id => car_id,
														 :spare_part_id => SparePart.find_by_code(el[:code].delete(" ")).id,
														 :unit => el[:amount],
														 :selling_price => el[:unit_price],
														 :total_price => el[:total_price],
														 :recieved => el[:recieved],
														 :sub_total => el[:sub_total],
														 :return => el[:return_money],
														 :discount => el[:discount],
														 :total_discount => el[:total_discount],
														 :status => "Paid",
														 :vat => el[:vat],
														 :car_history_id => last_history_id
														)
					spare_part = SparePart.find_by_code(el[:code].delete(" "))
					spare_part.amount_in_stock = spare_part.amount_in_stock.to_f - el[:amount].to_f
					spare_part.save!
---
INSERT INTO "sell_reports" ("car_history_id", "car_id", "created_at", "recieved", "return", "selling_price", "spare_part_id", "status", "sub_total", "total_price", "unit", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "spare_parts".* FROM "spare_parts"  WHERE "spare_parts"."code" = '00001' LIMIT 1
UPDATE "spare_parts" SET "amount_in_stock" = ?, "updated_at" = ? WHERE "spare_parts"."id" = 9  [["amount_in_stock", -7], ["updated_at", "2015-12-04 06:27:03.675573"]]