app/controllers/spare_parts_controller.rb

SELECT COUNT(*) FROM "spare_parts"  WHERE (amount_in_stock <= 4)
SELECT  "spare_parts".* FROM "spare_parts"   ORDER BY id LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "spare_parts"
---
	def index
		if params[:search]
			params_search = String(params[:search]).downcase
			@spare_parts = SparePart.where("lower(name) like ? or code like ?", "%#{params[:search]}%", "%#{params[:search]}%").order("id").paginate(:page => params[:page], :per_page => 10)
		else
			@spare_parts = SparePart.order("id").paginate(:page => params[:page], :per_page => 10)

SELECT  "spare_parts".* FROM "spare_parts"   ORDER BY "spare_parts"."id" DESC LIMIT 1
---
	def new
		@spare_part = SparePart.new
		@spare_part.code = SparePart.last.code.next

INSERT INTO "spare_parts" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-12-03 14:23:13.282635"], ["name", "Logo LED ទ្វារ,1"], ["updated_at", "2015-12-03 14:23:13.282635"]]
---
	def create
		@spare_part = SparePart.new(spare_part_params)
	  if @spare_part.save

SELECT  "spare_parts".* FROM "spare_parts"  WHERE "spare_parts"."id" = ? LIMIT 1  [["id", 11]]
---
	def edit
		@spare_part = SparePart.find(params[:id])

SELECT  "spare_parts".* FROM "spare_parts"  WHERE "spare_parts"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "spare_parts" SET "selling_price" = ?, "spare_part_type_id" = ?, "updated_at" = ? WHERE "spare_parts"."id" = 11  [["selling_price", 10.0], ["spare_part_type_id", "1"], ["updated_at", "2015-12-03 14:50:32.945606"]]
---
	def update
		@spare_part = SparePart.find(params[:id])
		@spare_part.update_attributes(spare_part_params)

SELECT  "spare_parts".* FROM "spare_parts"  WHERE "spare_parts"."id" = ? LIMIT 1  [["id", 10]]
DELETE FROM "spare_parts" WHERE "spare_parts"."id" = ?  [["id", 10]]
---
	def destroy
		@spare_part = SparePart.find(params[:id])
		@spare_part.destroy